Model: "model_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            [(None, None, None,  0                                            
__________________________________________________________________________________________________
input_3 (InputLayer)            [(None, None, None,  0                                            
__________________________________________________________________________________________________
model (Functional)              ((None, None, None,  478032      input_2[0][0]                    
                                                                 input_3[0][0]                    
__________________________________________________________________________________________________
subtract_3 (Subtract)           (None, None, None, 1 0           model[0][4]                      
                                                                 model[1][4]                      
__________________________________________________________________________________________________
up_sampling2d (UpSampling2D)    (None, None, None, 1 0           model[1][0]                      
__________________________________________________________________________________________________
lambda_3 (Lambda)               (None, None, None, 1 0           subtract_3[0][0]                 
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, None, None, 1 65664       up_sampling2d[0][0]              
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, None, None, 2 0           lambda_3[0][0]                   
                                                                 conv2d_10[0][0]                  
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, None, None, 1 295040      concatenate[0][0]                
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, None, None, 1 147584      conv2d_11[0][0]                  
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, None, None, 6 73792       conv2d_12[0][0]                  
__________________________________________________________________________________________________
subtract_2 (Subtract)           (None, None, None, 6 0           model[0][3]                      
                                                                 model[1][3]                      
__________________________________________________________________________________________________
up_sampling2d_1 (UpSampling2D)  (None, None, None, 6 0           conv2d_13[0][0]                  
__________________________________________________________________________________________________
lambda_2 (Lambda)               (None, None, None, 6 0           subtract_2[0][0]                 
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, None, None, 6 16448       up_sampling2d_1[0][0]            
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, None, None, 1 0           lambda_2[0][0]                   
                                                                 conv2d_14[0][0]                  
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, None, None, 1 0           concatenate_1[0][0]              
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, None, None, 6 73792       dropout_3[0][0]                  
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, None, None, 6 36928       conv2d_15[0][0]                  
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, None, None, 3 18464       conv2d_16[0][0]                  
__________________________________________________________________________________________________
subtract_1 (Subtract)           (None, None, None, 3 0           model[0][2]                      
                                                                 model[1][2]                      
__________________________________________________________________________________________________
up_sampling2d_2 (UpSampling2D)  (None, None, None, 3 0           conv2d_17[0][0]                  
__________________________________________________________________________________________________
lambda_1 (Lambda)               (None, None, None, 3 0           subtract_1[0][0]                 
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, None, None, 3 4128        up_sampling2d_2[0][0]            
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, None, None, 6 0           lambda_1[0][0]                   
                                                                 conv2d_18[0][0]                  
__________________________________________________________________________________________________
dropout_4 (Dropout)             (None, None, None, 6 0           concatenate_2[0][0]              
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, None, None, 3 18464       dropout_4[0][0]                  
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, None, None, 1 4624        conv2d_19[0][0]                  
__________________________________________________________________________________________________
subtract (Subtract)             (None, None, None, 1 0           model[0][1]                      
                                                                 model[1][1]                      
__________________________________________________________________________________________________
up_sampling2d_3 (UpSampling2D)  (None, None, None, 1 0           conv2d_20[0][0]                  
__________________________________________________________________________________________________
lambda (Lambda)                 (None, None, None, 1 0           subtract[0][0]                   
__________________________________________________________________________________________________
conv2d_21 (Conv2D)              (None, None, None, 1 1040        up_sampling2d_3[0][0]            
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, None, None, 3 0           lambda[0][0]                     
                                                                 conv2d_21[0][0]                  
__________________________________________________________________________________________________
dropout_5 (Dropout)             (None, None, None, 3 0           concatenate_3[0][0]              
__________________________________________________________________________________________________
conv2d_22 (Conv2D)              (None, None, None, 1 4624        dropout_5[0][0]                  
__________________________________________________________________________________________________
conv2d_23 (Conv2D)              (None, None, None, 2 290         conv2d_22[0][0]                  
__________________________________________________________________________________________________
conv2d_24 (Conv2D)              (None, None, None, 1 19          conv2d_23[0][0]                  
__________________________________________________________________________________________________
lambda_4 (Lambda)               (None, None, None)   0           conv2d_24[0][0]                  
==================================================================================================
Total params: 1,238,933
Trainable params: 1,238,933
Non-trainable params: 0
__________________________________________________________________________________________________
